@ECHO OFF
setlocal

REM Скрипт проверки выходного и праздничного дня
REM V 1.0.0 - первая эксплуатационная версия.

REM ==================================================
REM Установка переменных

REM Имя модуля.
SET MODUL_NAME=LOOP

REM Каталог запуска скрипта.
SET RUNDIR=%~dp0

REM Период запуска скрипта, в секундах.
SET INTERVAL=20

REM ==================================================
ECHO .
ECHO ==================================================
ECHO %date% %time% - START %MODUL_NAME% V 1.0.0


REM ==================================================
REM Запуск программы по циклу с интервалом.
:LOOP
CALL "%RUNDIR%START-MONITOR.cmd"
ping 127.0.0.1 -n %INTERVAL% > nul
GOTO LOOP

EXIT /B 0